cases/periodicHill/steadyState_kOmegaDavidsonNN/system/hillsSample
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      hillsSample;
}

// Diagnostic: samples the NN coefficient fields along the "hills" wall
// patch so their spatial variation (or lack of it) can be inspected
// directly, e.g. to check whether they are saturated at their clip
// bounds. Not part of the normal Allrun flow -- invoke manually with:
//   postProcess -func hillsSample -latestTime

type            surfaces;
libs            (sampling);
writeControl    timeStep;
writeInterval   1;
executeControl  timeStep;
executeInterval 1;
surfaceFormat   raw;
interpolationScheme cellPoint;
fields          (sigmakNN CkNN Comega2NN k omega);

surfaces
{
    hillsPatch
    {
        type            patch;
        patches         (hills);
        interpolate     false;
    }
}
